{
  "path": "/el",  
  "header": {
    "title": "Νικηφόρος Κλιάφας",
    "buttonList": [{
        "id":"1",
        "title": "Σχετικά",
        "path":"#about"
    },{
        "id":"2",
        "title": "Πρότζεκτ",
        "path": "#projects"
    },{
        "id":"3",
        "title": "Επικοινωνία",
        "path": "#contact"
    }]
  },
  "about": {
    "title": "Σχετικά με εμένα",
    "profile": "Είμαι τεταρτοετής Φοιτητής Πληροφορικής στο Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης. Διαθέτω γνώσεις σε βάσεις δεδομένων, ανάλυση δεδομένων και γλώσσες προγραμματισμού όπως Java, Python και SQL, ενώ μου προκαλούν αυξημένο ενδιαφέρον οι τεχνολογίες των Big Data. Αναζητώ ευκαιρίες για να εφαρμόσω τις δεξιότητές μου σε πραγματικά δεδομένα και να αναπτύξω τις γνώσεις μου στον τομέα που σπουδάζω.",
    "resume": "Δείτε το Βιογραφικό μου"
  },
  "projects": {
    "title": "Πρότζεκτ",
    "projectData": [
      {
        "id": 1,
        "title": "Ταξινόμηση Εικόνων με Συνελικτικά Νευρωνικά Δίκτυα (CNN).",
        "description": "Αυτή η εργασία Βαθιάς Μάθησης εστιάζει στην κατασκευή, εκπαίδευση και αξιολόγηση μιας αρχιτεκτονικής CNN για την ταξινόμηση εικόνων του συνόλου δεδομένων CIFAR-10. Η μεθοδολογία περιλαμβάνει data augmentation, ρύθμιση υπερπαραμέτρων και υλοποίηση σε PyTorch, επιτυγχάνοντας ακρίβεια ταξινόμησης που ξεπερνά σημαντικά τα παραδοσιακά μοντέλα οπως KNN και Nearest Centroid."
      },
      {
        "id": 2,
        "title": "Υλοποίηση Χωρικού Καταλόγου R*Tree σε Java",
        "description": "Η εργασία εστιάζει στη διαχείριση χωρικών βάσεων δεδομένων. Παρουσιάζεται μια πλήρης, προσαρμοσμένη υλοποίηση του καταλόγου R*Tree, βελτιστοποιημένη για την οργάνωση μεγάλων συνόλων δεδομένων που προέρχονται από αρχεία OpenStreetMap (OSM). Το σύστημα υποστηρίζει πολύπλοκα χωρικά ερωτήματα, όπως Range Search, k-Nearest Neighbors (kNN) και ανάλυση Skyline."
      },
      {
        "id": 3,
        "title": "Εφαρμογή Διαχείρισης Ταινιών (Java Swing)",
        "description": "Ανάπτυξη μιας εφαρμογής desktop με χρήση της βιβλιοθήκης Java Swing, η οποία λειτουργεί ως πλατφόρμα διαχείρισης ταινιών και σειρών. Τα βασικά χαρακτηριστικά περιλαμβάνουν τη σύνδεση χρήστη, περιηγήσιμους καταλόγους απο ταινίες και σειρές και ένα σύστημα για υποβολή και διαχείριση προσωπικών κριτικών και αξιολογήσεων. Η εργασία δίνει έμφαση στο σχεδιασμό GUI και τις αρχές αντικειμενοστραφούς προγραμματισμού (χωρίς λήψη ταινιών ή σειρών για την εργασία)."
      },
      {
        "id": 4,
        "title": "Εφαρμογή Παρακολούθησης Οχημάτων (Android Studio)",
        "description": "Μία πρακτική εφαρμογή Android, κατασκευασμένη σε Android Studio, για την παρακολούθηση και διαχείριση οχημάτων, όπως η διαχείριση των  αρχείων καταγραφής κατανάλωσης καυσίμου και των αναφορών εξόδων. Χρησιμοποιεί μια SQL Database για την αποθήκευση δεδομένων."
      },
      {
        "id": 5,
        "title": "Σύστημα Διαχείρισης Βάσης Δεδομένων για Αντιπροσωπείες Οχημάτων (ΣΔΒΔ)",
        "description": "Σχεδιασμός και κανονικοποίηση ενός σχεσιακού σχήματος βάσης δεδομένων (DBMS) προσαρμοσμένου για τη διαχείριση των λειτουργιών μιας αντιπροσωπείας αυτοκινήτων. Το σχήμα μοντελοποιεί κρίσιμες οντότητες όπως το απόθεμα (inventory), τη διαχείριση πελατών (CRM), τις συναλλαγές πωλήσεων και τα δεδομένα υπαλλήλων."
      },
      {
        "id": 6,
        "title": "Δικτυακός προγραμματισμός Reply-Request (TCP/IP)",
        "description": "Η εργασία αυτή επιδεικνύει τον προγραμματισμό δικτύου σε χαμηλό επίπεδο. Υλοποιεί μια ισχυρή εφαρμογή client-server με χρήση Java Sockets, σχεδιασμένη για τη διαχείριση ταυτόχρονης και αμφίδρομης επικοινωνίας Reply-Request μέσω του πρωτοκόλλου TCP/IP."
      }
    ]
  },
  "skills": {
    "title": "Δεξιότητες",
    "description": "Αυτές είναι οι τεχνολογίες που έχω χρησιμοποιήσει"
  },
  "contact": {
    "title": "Επικοινωνία",
    "description": "Μη διστάσετε να επικοινωνήσετε!"
  }
}